In [9]:
import pandas as pd

In [8]:
#Series de Pandas
numeros = [3,4,5,6,7]
serie = pd.Series(numeros)
serie, type(serie)

(0    3
 1    4
 2    5
 3    6
 4    7
 dtype: int64,
 pandas.core.series.Series)

In [4]:
#DataFrames 
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["New York", "London", "Paris"]
}
data, type(data)

({'name': ['Alice', 'Bob', 'Charlie'],
  'age': [25, 30, 35],
  'city': ['New York', 'London', 'Paris']},
 dict)

In [5]:
#Generar un DataFrame apartir de un diccionario
df = pd.DataFrame(data=data)
df

      name  age      city
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [6]:
#Exportar DataFrame
df.to_csv("data.csv")

In [7]:
#Importar DataFrame
import_df = pd.read_csv("data.csv", index_col=0)

import_df

      name  age      city
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [13]:
#Seleccionar una columna 

name = df["name"]
print(name, type(name))

0      Alice
1        Bob
2    Charlie
Name: name, dtype: object <class 'pandas.core.series.Series'>

In [11]:
#Seleccionar una o mas columnas 

df[["name", "age"]]

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

In [21]:
#Filtrar por Indice

fila = df.loc[2]
fila

name    Charlie
age          35
city      Paris
Name: 2, dtype: object

In [16]:
#Filtrar por Condicion

df[df["age"] > 28]

      name  age    city
1      Bob   30  London
2  Charlie   35   Paris

In [22]:
#Filtrar por una o mas Condiciones

filtrar = (df["name"].str.startswith("A")) & (df["age"] > 20)
df[filtrar]

    name  age      city
0  Alice   25  New York

In [24]:
#Filtrar por Query

df.query("age > 28")

      name  age    city
1      Bob   30  London
2  Charlie   35   Paris

In [30]:
df[df["name"].isin(["Bob", "Messi", "Charlie"])]

      name  age    city
1      Bob   30  London
2  Charlie   35   Paris

In [31]:
#Filtrar por Funcion

def longitud_5(name):
    return  len(name) == 5

df[df["name"].apply(longitud_5)]

    name  age      city
0  Alice   25  New York

In [33]:
#Filtrar por edad entre 30 y 35 (inclusive)

df[df["age"].between(30, 35)]

      name  age    city
1      Bob   30  London
2  Charlie   35   Paris